chtMultiregionFoam/pipeheaterExchg/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

11
(
    outershell
    {
        type            patch;
        nFaces          1712;
        startFace       39769;
    }
    copperend1
    {
        type            patch;
        nFaces          49;
        startFace       41481;
    }
    tubeend1
    {
        type            patch;
        nFaces          65;
        startFace       41530;
    }
    shellend1
    {
        type            patch;
        nFaces          107;
        startFace       41595;
    }
    copperend2
    {
        type            patch;
        nFaces          49;
        startFace       41702;
    }
    tubeend2
    {
        type            patch;
        nFaces          69;
        startFace       41751;
    }
    shellend2
    {
        type            patch;
        nFaces          107;
        startFace       41820;
    }
    inletshell
    {
        type            patch;
        nFaces          62;
        startFace       41927;
    }
    outletshell
    {
        type            patch;
        nFaces          62;
        startFace       41989;
    }
    inlet
    {
        type            patch;
        nFaces          24;
        startFace       42051;
    }
    outlet
    {
        type            patch;
        nFaces          24;
        startFace       42075;
    }
)

// ************************************************************************* //
